# 利用 Python 进行数据分析

In [2]:
# 变量拆分常用来迭代元组或列表序列：
seq = [(1, 2, 3), (4, 5, 6), (7, 8, 9)]
for a, b, c in seq:
    print(f'a={a}, b={b}, c={c}') # f-string 格式化

a=1, b=2, c=3
a=4, b=5, c=6
a=7, b=8, c=9

In [12]:
# 元组拆分
values = 1, 2, 3, 4, 5
a, b, *rest = values
a, b
rest
# rest 可以取其他的名称 如下划线 _
a, b, *_ = values
_

[3, 4, 5]

In [13]:
# tuple 方法
# .count() 统计某个值的出现频率
a = (1, 2, 2, 2, 3, 4, 2)
a.count(2)

4

In [14]:
# list 串联和组合列表，.extend() 追加元素 最优（比'+'快）
x = [4, None, 'foo']
x.extend([7, 8, (2, 3)])
x

[4, None, 'foo', 7, 8, (2, 3)]

In [18]:
# 二分搜索和维护已排序的列表
# bisect 模块支持二分查找，和向已排序的列表插入值
# bisect.bisect 可以找到插入值后仍保证排序的位置
# bisect.insort 是向这个位置插入值

import bisect
c = [1, 2, 2, 2, 3, 4, 7]
bisect.bisect(c, 2)
bisect.bisect(c, 5)
c
bisect.insort(c, 6)
c

[1, 2, 2, 2, 3, 4, 6, 7]

In [19]:
# list 切片 list[start:stop:step]
# step=-1，可以将列表或元组颠倒过来
seq = [7, 2, 3, 7, 5, 6, 0, 1]
seq[::-1]

[1, 0, 6, 5, 7, 3, 2, 7]

### 序列函数

In [23]:
# enumerate() 函数
# 迭代序列时，跟踪当前项的序号
collection = [2, 4, 5, 8, 7, 34]
for i, value in enumerate(collection):
    print(i, value)
# 索引数据时，计算序列（唯一的）dict 映射到位置的值
some_list = ['foo', 'bar', 'baz']
mapping = {}
for i, v in enumerate(some_list):
    mapping[v] = i
mapping

0 2
1 4
2 5
3 8
4 7
5 34

{'foo': 0, 'bar': 1, 'baz': 2}

In [25]:
# sorted() 函数
# 从任意序列的元素返回一个新的排好序的列表
d = sorted([7, 1, 3, 8, 0, 4, 2])
print(d)
sorted('horse race')

[0, 1, 2, 3, 4, 7, 8]

[' ', 'a', 'c', 'e', 'e', 'h', 'o', 'r', 'r', 's']

In [38]:
# zip() 函数
# 可以将多个列表、元组或其它序列成对组合成一个元组列表
seq1 = ['foo', 'bar', 'baz']
seq2 = ['one', 'two', 'three']
zipped = zip(seq1, seq2)
list(zipped)

# 可以处理任意多的序列，元素的个数取决于最短的序列
seq3 = [False, True]
list(zip(seq1, seq2, seq3))

# 常见用法之一是同时迭代多个序列，可能结合 enumerate 使用
for i, (a, b) in enumerate(zip(seq1, seq2)):
    print(f'{i}: {a}, {b}')

# 给出一个“被压缩的”序列， zip 可以被用来解压序列。也可以当作把行的列表转换为列的列表
pitchers = [('Nolan', 'Ryan'), ('Roger', 'Clemens'),
           ('Schilling', 'Curt')]
print(*pitchers)
first_names, last_names = zip(*pitchers)
first_names
last_names

0: foo, one
1: bar, two
2: baz, three
('Nolan', 'Ryan') ('Roger', 'Clemens') ('Schilling', 'Curt')

('Ryan', 'Clemens', 'Curt')

In [40]:
# reversed() 函数
# 可以从后向前迭代一个序列
list(reversed(range(10)))

[9, 8, 7, 6, 5, 4, 3, 2, 1, 0]

In [43]:
# Numpy
import numpy as np
my_arr = np.arange(1000000)
my_list = list(range(1000000))

%time for _ in range(10): my_arr2 = my_arr * 2
%time for _ in range(10): my_list2 = [x * 2 for x in my_list]

Wall time: 31.2 ms
Wall time: 1.45 s

## Pandas

> **两个主要的数据结构：Series & DataFrame**

### Series

**类似于一维数组的对象**

**构成：**

*一组数据（各种 NumPy 数据类型）*

*数据标签（即索引）*

In [19]:
import pandas as pd
from pandas import Series

obj = pd.Series([4, 7, -5, 3])
obj  # 0,1, 2, 3 即为数据标签（索引）

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
# Series的字符串表现形式为：索引在左边，值在右边
# Series 的 values 和 index 属性获取其数组表示形式和索引对象

import pandas as pd
from pandas import Series

obj = pd.Series([4, 7, -5, 3])
obj.values
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
# 可以创建带有索引的 Series 对象

import pandas as pd
from pandas import Series

obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
# 通过索引的方式选取Series中的单个值
import pandas as pd
from pandas import Series

obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2['a']

-5

In [12]:
# 通过索引列表的方式选取Series中的一组值
import pandas as pd
from pandas import Series

obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2[['a', 'b', 'c']] # ['a', 'b', 'c'] 索引列表

a   -5
b    7
c    3
dtype: int64

In [16]:
# 使用 NumPy 函数或类似 NumPy 的运算（如根据布尔型数组进行过滤、标量乘法、应用数学函数等）都会保留索引值的链接
import pandas as pd
from pandas import Series
import numpy as np

obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

obj2[obj2 > 0]

obj2 * 2

np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [18]:
# Series 可看作是一个定长的有序字典
import pandas as pd
from pandas import Series

obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

'b' in obj2
'f' in obj2

False

In [20]:
# 通过 Python 字典创建 Series
import pandas as pd
from pandas import Series

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [21]:
# 可以传入排好序的字典的键以改变顺序
import pandas as pd
from pandas import Series

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4 # 'California' 不在 sdata 中，结果以 NaN 填充；'Utah' 不在 states 中，最终结果会被除去

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [22]:
# Series 对象本身及其索引都有一个 name 属性
import pandas as pd
from pandas import Series

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)

obj4.name = 'population'
obj4.index.name = 'state'

obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [23]:
# Series 的索引可以通过赋值的方式原地修改
import pandas as pd
from pandas import Series

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)

obj4.index = ['广州', '上海', '佛山', '中山']
obj4

广州        NaN
上海    35000.0
佛山    16000.0
中山    71000.0
dtype: float64

### DataFrame

- 建DataFrame的办法有很多，最常用的一种是直接传入一个由等长列表或NumPy数组组成的字典：

In [3]:
import pandas as pd
from pandas import DataFrame

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [4]:
# 对于特别大的DataFrame，head方法会选取前五行：
import pandas as pd
from pandas import DataFrame

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [5]:
# 如果指定了列序列，则DataFrame的列就会按照指定顺序进行排列：
import pandas as pd
from pandas import DataFrame

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [8]:
# 如果传入的列在数据中找不到，就会在结果中产生缺失值：
import pandas as pd
from pandas import DataFrame

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [30]:
# 通过类似字典标记的方式或属性的方式，可以将 DataFrame 的列获取为一个 Series
import pandas as pd
from pandas import DataFrame

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

frame2['state']
frame2.year  
# frame2[column]适用于任何列的名，但是frame2.column只有
# 在列名是一个合理的Python变量名时才适用

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [31]:
# 行也可以通过位置或名称的方式获取，如 loc 属性
import pandas as pd
from pandas import DataFrame

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [34]:
# 列可以通过赋值的方式进行修改
import pandas as pd
from pandas import DataFrame

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

frame2['debt']  = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [35]:
# 列可以通过赋值的方式进行修改
import pandas as pd
from pandas import DataFrame
import numpy as np

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

frame2['debt']  = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [39]:
# 将列表或数组赋值给某个列时，其长度必须跟 DataFrame 的长度相匹配
import pandas as pd
from pandas import DataFrame


data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

frame2['debt']  = [10, 39, 30, 49, 90,]
frame2

ValueError: Length of values does not match length of index

In [40]:
# 如果将 Series 赋值给列，就会精确匹配 DataFrame 的索引，空位将被填充缺失值
import pandas as pd
from pandas import DataFrame


data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt']  = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [42]:
# 为不存在的列赋值会创建出一个新列
import pandas as pd
from pandas import DataFrame


data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop debt  eastern
one    2000    Ohio  1.5  NaN     True
two    2001    Ohio  1.7  NaN     True
three  2002    Ohio  3.6  NaN     True
four   2001  Nevada  2.4  NaN    False
five   2002  Nevada  2.9  NaN    False
six    2003  Nevada  3.2  NaN    False

In [44]:
# 关键字 del 用于删除列
import pandas as pd
from pandas import DataFrame


data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

frame2['eastern'] = frame2.state == 'Ohio'
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [45]:
# 嵌套字典
import pandas as pd
from pandas import DataFrame

pop = {'Nevada': {2001: 2.4, 2002:2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
# 嵌套字典传给 DataFrame, pandas 就会被解释为：
# 外层字典的键作为列，内层字典的键则作为行索引
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [46]:
# DataFrame 转置（交换行和列）
import pandas as pd
from pandas import DataFrame

pop = {'Nevada': {2001: 2.4, 2002:2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)

frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [49]:
# 内层字典的键会被合并、排序以形成最终的索引
# 但明确指定了索引就不会
import pandas as pd
from pandas import DataFrame

pop = {'Nevada': {2001: 2.4, 2002:2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [52]:
# Series 组成的字典差不多也是一样的用法
import pandas as pd
from pandas import DataFrame

pop = {'Nevada': {2001: 2.4, 2002:2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)

pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

### 索引对象

> pandas 的索引对象负责管理轴标签和其他元数据（比如轴名称等）。构建 Series 或 DataFrame 时，所用到的任何数组或其他序列的标签都会被转换成一个Index

In [54]:
import pandas as pd
from pandas import Series

obj = pd.Series(range(3), index=['a', 'b', 'c'])

index = obj.index
index
index[1:]

Index(['b', 'c'], dtype='object')

In [55]:
# Index 对象是不可变的
import pandas as pd
from pandas import Series

obj = pd.Series(range(3), index=['a', 'b', 'c'])

index = obj.index
index[1] = 'd'

TypeError: Index does not support mutable operations

In [56]:
# 不可变可以使 Index 对象在多个数据结构之间安全共享
import pandas as pd
from pandas import Series

labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [57]:
import pandas as pd
from pandas import Series

obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [58]:
import pandas as pd
from pandas import Series

obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2.index is labels

True

In [61]:
# 除了类似于数组，Index的功能也类似一个固定大小的集合
import pandas as pd
from pandas import DataFrame

pop = {'Nevada': {2001: 2.4, 2002:2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)

frame3.columns

'Ohio' in frame3.columns

2003 in frame3.index

False

In [63]:
# 与python的集合不同，pandas的Index可以包含重复的标签
# 选择重复的标签，会显示所有的结果

import pandas as pd
from pandas import DataFrame

dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## 基本功能

>介绍操作Series和DataFrame中的数据的基本手段

### 重新索引

In [4]:
# reindex() 方法，作用是创建一个新对象，它的数据符合新的索引
import pandas as pd
from pandas import Series, DataFrame

obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
print(obj)

# 用 Series 的 reindex 将会根据新索引进行重排。如果某个索引值当前不存在，就会引入缺失值
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [12]:
# 对于时间序列这样的有序数据，重新索引时可能需要做一些插值处理。
# method选项即可达到此目的，例如，使用ffill可以实现前向值填充：

import pandas as pd
from pandas import Series, DataFrame

obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
print(obj3)

# obj3.reindex(range(6), method='ffill')
# obj3 # 结果与书本不一样， 需要确认

0      blue
2    purple
4    yellow
dtype: object

In [14]:
# 借助DataFrame，reindex可以修改（行）索引和列。只传递一个序列时，会重新索引结果的行
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index=['a', 'c', 'd'],
                    columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [15]:
# 借助DataFrame，reindex可以修改（行）索引和列。只传递一个序列时，会重新索引结果的行
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index=['a', 'c', 'd'],
                    columns=['Ohio', 'Texas', 'California'])

frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [16]:
# 列可以用 columns 关键字重新索引
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index=['a', 'c', 'd'],
                    columns=['Ohio', 'Texas', 'California'])
states = ['Texas', 'Utah', 'California']

frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### 丢弃指定轴上的项

In [21]:
# 丢弃某条轴上的一个或多个项，只要有一个索引数组或列表即可
# drop 方法返回的是一个在指定轴上删除了指定值的新对象

import pandas as pd
from pandas import Series, DataFrame
import numpy as np

obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
print(obj)

new_obj = obj.drop('c')
print(new_obj)

obj.drop(['d', 'c'])

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64
a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
e    4.0
dtype: float64

In [27]:
# DataFrame 可以删除任意轴上的索引值
# 新建 DataFrame
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [30]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

# 用标签序列调用 drop 会从行标签（axis 0）删除值
data.drop(['Colorado', 'Ohio']) # 指明是行标签， axis=0 不需要标出

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [29]:
# 通过传递 axis=1 或 axis='columns'可以删除列的值
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])


data.drop('two', axis=1) # 列索引标出的同时，也需要标明 axis

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [31]:
# 通过传递 axis=1 或 axis='columns'可以删除列的值
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])


data.drop(['two', 'four'], axis='columns') # 列索引标出的同时，也需要标明 axis

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [33]:
# 许多函数，如drop，会修改Series或DataFrame的大小或形状，可以就地修改对象，不会返回新的对象：

import pandas as pd
from pandas import Series, DataFrame
import numpy as np

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])


data.drop('Ohio', inplace=True)
data

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [34]:
# 许多函数，如drop，会修改Series或DataFrame的大小或形状，可以就地修改对象，不会返回新的对象：

import pandas as pd
from pandas import Series, DataFrame
import numpy as np

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])


data.drop('one', axis=1, inplace=True) # 小心使用 inplace，它会销毁所有被删除的数据
data

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

### 索引、选取、过滤

In [46]:
# Series索引（obj[...]）的工作方式类似于NumPy数组的索引，只不过Series的索引值不只是整数。
import pandas as pd
from pandas import Series
import numpy as np

obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj
print(obj['b'])
print('--------')
print(obj[1])
print('----------')
print(obj[2:4])
print('-----------')
print(obj[['b', 'a', 'd']])
print('-----------------------')
print(obj[[1, 3]])
print('-------------------------')
print(obj[obj < 2])
print('-------------------------')

# 利用标签的切片运算与普通的Python切片运算不同，其末端是包含的：
obj['b':'c']

# 用切片可以对Series的相应部分进行设置：
obj['b':'c'] = 5
obj

1.0
--------
1.0
----------
c    2.0
d    3.0
dtype: float64
-----------
b    1.0
a    0.0
d    3.0
dtype: float64
-----------------------
b    1.0
d    3.0
dtype: float64
-------------------------
a    0.0
b    1.0
dtype: float64
-------------------------

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [48]:
# 用一个值或序列对DataFrame进行索引其实就是获取一个或多个列：
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
print(data['two'])
print('-------------')
print(data[['three', 'one']])

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32
-------------
          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

### 用 loc 和 iloc 进行选取

**对于DataFrame的行的标签索引，引入了特殊的标签运算符loc和iloc。它们可以让你用类似NumPy的标记，使用轴标签（loc）或整数索引（iloc），从DataFrame选择行和列的子集。**

In [55]:
import pandas as pd
from pandas import DataFrame
import numpy as np

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [50]:
# 通过标签选择一行和多列
import pandas as pd
from pandas import DataFrame
import numpy as np

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [51]:
# 用 iloc 和 整数 进行选取
import pandas as pd
from pandas import DataFrame
import numpy as np

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [52]:
import pandas as pd
from pandas import DataFrame
import numpy as np

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [53]:
import pandas as pd
from pandas import DataFrame
import numpy as np

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [54]:
# loc、iloc 也适用于一个标签或多个标签的切片
import pandas as pd
from pandas import DataFrame
import numpy as np

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data.loc[:'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [56]:
import pandas as pd
from pandas import DataFrame
import numpy as np

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

## 数据加载、存储与文件格式

### 读写文本格式的数据

| 函数       | 说明          |
| ----       | -----------------------------------------------------------------------------------  |
| read_csv   | 从文件、URL、文件型对象中加载带分隔符的数据。默认分隔符为 逗号                       |
| read_fwf   | 读取定宽列格式数据（也就是说，没有分隔符）                                           |
| read_clipboard | 读取剪贴板中的数据，可以看做 read_table 的剪贴板版。在将网页转换为表格时很有用   |
| read_excel | 从 Excel XLS 或 XLSX file 读取表格数据           |
| read_hdf | 读取 pandas 写的 HDF5 文件                         |
| read_html | 读取 HTML 文档中的所有表格                         |
| read_json | 读取 JSON(JavaScript Object Notation)字符串中的数据              |
| read_msgpack | 二进制格式编码的 pandas 数据                |
| read_pickle | 读取 Python pickle 格式中存储的任意对象      |
| read_sas | 读取存储于 SAS 系统自定义存储格式的 SAS 数据集  |
| read_sql | （使用 SQLAlchemy）读取 SQL 查询结果为 pandas 的 DataFrame |
| read_stata | 读取 Stata 文件格式的数据集                         |
| read_feather | 读取 Feather 二进制文件格式                         |

In [62]:
!type ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [64]:
import pandas as pd

df = pd.read_csv('ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [2]:
import pandas as pd
pd.read_csv('ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [67]:
# 没有标题行的文件 读入方式
!type ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [68]:
# ① 让 pandas 为其分配默认的列名
import pandas as pd
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [69]:
# ②自定义列名
import pandas as pd
pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [70]:
# 希望将message列做成DataFrame的索引。你可以明确表示要将该列放到索引4的位置上，
# 也可以通过index_col参数指定"message"：
import pandas as pd
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [72]:
# 如果希望将多个列做成一个层次化索引，只需传入由列编号或列名组成的列表即可：
!type csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [73]:
import pandas as pd
parsed = pd.read_csv('csv_mindex.csv', index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [91]:
# 有些表格可能不是用固定的分隔符去分隔字段的（比如空白符或其它模式）
list(open('ex3.txt'))

['            A         B         C \n',
 'aaa -0.264438 -1.026059 -0.619500 \n',
 'bbb 0.927272 0.302904 -0.032399 \n',
 'ccc -0.264273 -0.386314 -0.217601 \n',
 'ddd -0.871858 -0.348382 1.100491 ']

In [92]:
import pandas as pd
result = pd.read_csv('ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [94]:
# 用skiprows跳过文件的第一行、第三行和第四行
import pandas as pd
!type ex4.csv

pd.read_csv('ex4.csv', skiprows=[0, 2, 3])

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [95]:
# 缺失值处理是文件解析任务中的一个重要组成部分。缺失数据经常是要么没有（空字符串），
# 要么用某个标记值表示。默认情况下，pandas会用一组经常出现的标记值进行识别，比如NA及NULL：

!type ex5.csv

import pandas as pd
result = pd.read_csv('ex5.csv')
result

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [96]:
!type ex5.csv

import pandas as pd
result = pd.read_csv('ex5.csv')
pd.isnull(result)

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [97]:
!type ex5.csv
# na_values可以用一个列表或集合的字符串表示缺失值：
import pandas as pd
result = pd.read_csv('ex5.csv', na_values=['NULL'])
result

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [99]:
# 字典的各列可以使用不同的NA标记值：
!type ex5.csv

import pandas as pd
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv('ex5.csv', na_values=sentinels)

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### 逐块读取文本文件

In [3]:
import pandas as pd
pd.options.display.max_rows = 10
result = pd.read_csv('ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [4]:
# 如果只想读取几行（避免读取整个文件），通过nrows进行指定即可
import pandas as pd

pd.read_csv('ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [5]:
# 要逐块读取文件，可以指定chunksize（行数）：
import pandas as pd

chunker = pd.read_csv('ex6.csv', chunksize=1000)
chunker

In [6]:
import pandas as pd
from pandas import Series

chunker = pd.read_csv('ex6.csv', chunksize=1000)
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### 将数据写出到文本格式

In [7]:
import pandas as pd
data = pd.read_csv('ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [9]:
# 利用DataFrame的to_csv方法，我们可以将数据写到一个以逗号分隔的文件中
import pandas as pd
data.to_csv('out.csv')
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo